Белгипрозем_2017/src/Documents/КоррекцияУчетДоговоров/КоррекцияУчетДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КоррекцияУчетДоговоров</name>
  <registerRecords>AccumulationRegister.УчетДоговоров</registerRecords>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ВнутренниеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапДоговора</name>
    <type>
      <types>CatalogRef.мЭтапыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.мСтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсвобождениеОтНДС</name>
    <type>
      <types>CatalogRef.мОсвобождениеОтНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <comment>Сумма с НДС</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Белгипрозем_2017/src/Documents/КоррекцияУчетДоговоров/ManagerModule.bsl
// Инициализирует таблицы значений, содержащие данные документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст ="ВЫБРАТЬ
	              |	ДанныеДокумента.Дата КАК Период,
	              |	ДанныеДокумента.Ссылка КАК Ссылка,
	              |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	              |	ДанныеДокумента.Договор КАК Договор,
	              |	ДанныеДокумента.ЭтапДоговора КАК ЭтапДоговора,
	              |	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	              |	ДанныеДокумента.ОсвобождениеОтНДС КАК ОсвобождениеОтНДС,
	              |	"""" КАК НомерДокумента,
	              |	ДанныеДокумента.НДС КАК НДС,
	              |	ДанныеДокумента.Сумма КАК Сумма
	              |ИЗ
	              |	Документ.КоррекцияУчетДоговоров КАК ДанныеДокумента
	              |ГДЕ
	              |	ДанныеДокумента.Ссылка = &Ссылка";
	Результат = Запрос.Выполнить();
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаУчетДоговоров", Результат.Выгрузить());
		
КонецПроцедуры // ИнициализироватьДанныеДокумента()
